Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: So you might want to change 2 lines in ``potrace-wrapper.sh`` --- open ``potrace-wrapper.sh`` and remove imagemagick from line 55 and line 64:
it_it: Quindi si potrebbero doler modificare 2 righe in ``potrace-wrapper.sh``: aprire ``potrace-wrapper.sh`` e rimuovere imagemagick dalla riga 55 e dalla riga 64:

source: So, if you change a widget’s position or size and then immediately read it, call :cpp:func:`lv_obj_update_layout` first to ensure the values are up to date.
it_it: Quindi, se si modifica la posizione o le dimensioni di un widget e poi lo si legge immediatamente, è necessario chiamare prima :cpp:func:`lv_obj_update_layout` per assicurarsi che i valori siano aggiornati.

source: So, to process the ``matchbox-desktop_1.2.3.bb`` recipe file, you might type the following::
it_it: Quindi, per elaborare il file della ricetta ``matchbox-desktop_1.2.3.bb``, si potrebbe digitare quanto segue:

source: Software based screen rotation is supported in partial mode.
it_it: La rotazione dello schermo basata su software è supportata in modalità parziale.

source: Solid color backgrounds
it_it: Background a tinta unita

source: Solution
it_it: Soluzione

source: Solving the Problem
it_it: Risoluzione del Problema

source: Some ARM Cortex-A and Cortex-R processors with the ARMv7 architecture and every ARM Cortex-A and Cortex-R processor from the ARMv8 architecture support the `Neon SIMD <https://www.arm.com/technologies/neon>` instruction set.
it_it: Alcuni processori ARM Cortex-A e Cortex-R con architettura ARMv7 e tutti i processori ARM Cortex-A e Cortex-R con architettura ARMv8 supportano il set di istruzioni `Neon SIMD <https://www.arm.com/technologies/neon>`.

source: Some ESP file systems provide automatic generation from a host folder using CMake.
it_it: Alcuni file system ESP forniscono la generazione automatica da una cartella host tramite CMake.

source: Some ESP32 chip series, like the ESP32-P4 support the Pixel Processing Accelerator hardware (PPA), which is capable of speeding-up the filling and image blending operations, this peripheral works with the DMA-2D hardware which is responsible to move the input/output buffers into/from the PPA processing engine.
it_it: Alcune serie di chip ESP32, come l'ESP32-P4, supportano l'hardware Pixel Processing Accelerator (PPA), in grado di accelerare le operazioni di riempimento e fusione delle immagini. Questa periferica funziona con l'hardware DMA-2D, responsabile dello spostamento dei buffer di input/output da/verso il motore di elaborazione PPA.

source: Some STM32s have a specialized peripheral called LTDC (LCD-TFT Display Controller) for driving displays.
it_it: Alcuni STM32 dispongono di una periferica specializzata chiamata LTDC (LCD-TFT Display Controller) per il controllo dei display.

source: Some applications require assigning physical buttons to multiple key events depending on the context: arrow keys may be used in a screen to navigate across widgets, and used to interact with one widget in another screen.
it_it: Alcune applicazioni richiedono l'assegnazione di pulsanti fisici a più eventi tasto a seconda del contesto: i tasti freccia possono essere utilizzati in una schermata per navigare tra i widget e per interagire con un widget in un'altra schermata.

source: Some aspects of the scrolling animations in long modes :cpp:enumerator:`LV_LABEL_LONG_SCROLL` and :cpp:enumerator:`LV_LABEL_LONG_SCROLL_CIRCULAR` can be customized by setting the Label's animation style property, using :cpp:func:`lv_style_set_anim`.
it_it: Alcuni aspetti delle animazioni di scorrimento nelle modalità lunghe :cpp:enumerator:`LV_LABEL_LONG_SCROLL` e :cpp:enumerator:`LV_LABEL_LONG_SCROLL_CIRCULAR` possono essere personalizzati impostando la proprietà di stile dell'animazione dell'etichetta, utilizzando :cpp:func:`lv_style_set_anim`.

source: Some chips from Espressif such as the ESP32-P4 family features a peripheral that enhances the copy of 2-D data from a place to another, including output this 2-D data to other peripherals.
it_it: Alcuni chip di Espressif, come la famiglia ESP32-P4, sono dotati di una periferica che migliora la copia di dati 2D da una posizione all'altra, incluso l'output di questi dati 2D su altre periferiche.

source: Some defconfigs are available in ``configs/defconfigs`` folder.
it_it: Alcuni file defconfig sono disponibili nella cartella ``configs/defconfigs``.

source: Some display controllers have specific requirements for the window area where the rendered image can be sent (e.g., `x1` must be even, and `x2` must be odd).
it_it: Alcuni controller di display hanno requisiti specifici per l'area della finestra in cui può essere inviata l'immagine renderizzata (ad esempio, `x1` deve essere pari e `x2` deve essere dispari).

source: Some event functions are not triggered.
it_it: Alcune funzioni evento non vengono attivate.

source: Some example URLs:
it_it: Alcuni URL di esempio:

source: Some examples are:
it_it: Alcuni esempi sono:

source: Some examples for ``idx``:
it_it: Alcuni esempi per ``idx``:

source: Some examples of the supported display types:
it_it: Alcuni esempi dei tipi di display supportati:

source: Some examples:
it_it: Alcuni esempi:

source: Some functions and draw descriptors require area or point parameters.
it_it: Alcune funzioni e descrittori di disegno richiedono parametri di area o punto.

source: Some functions use the :cpp:struct:`lv_calendar_date_t` type which is a structure with ``year``, ``month`` and ``day`` fields.
it_it: Alcune funzioni utilizzano il tipo :cpp:struct:`lv_calendar_date_t` una struttura con i campi ``year``, ``month`` e ``day``.

source: Some labels of the Scale might be drawn upside down (to match the tick) if the Scale includes a certain angle range.
it_it: Alcune etichette della "Scale" potrebbero essere disegnate capovolte (per corrispondere alla tacca) se include un certo intervallo di angoli.

source: Some of the ESP32 chips like the ESP32P4 family have built-in support for driving display through standard interfaces like RGB and MIPI, the Espressif IDF (esp-idf), provides the necessary drivers, leaving to the user the responsibility to integrate them into the LVGL display subsystem.
it_it: Alcuni chip ESP32, come la famiglia ESP32P4, hanno il supporto integrato per la gestione del display tramite interfacce standard come RGB e MIPI. L'IDF Espressif (esp-idf) fornisce i driver necessari, lasciando all'utente la responsabilità di integrarli nel sottosistema di visualizzazione LVGL.

source: Some of the LVGL configuration (such as target screen resolution) will be automatically derived from the Renesas `configuration.xml`.
it_it: Alcune impostazioni di configurazione LVGL (come la risoluzione dello schermo target) verranno derivate automaticamente dal file `configuration.xml` di Renesas.

source: Some of the high-end chips of ESP32 features an external memory on its module, it is Pseudo-Static Random Access Memory, the PSRAM. In general values from 4 to 16MB are present on the chip and LVGL can take a portion of this memory to:
it_it: Alcuni dei chip ESP32 di fascia alta dispongono di una memoria esterna sul proprio modulo, la PSRAM (Pseudo-Static Random Access Memory). In generale, sul chip sono presenti valori da 4 a 16 MB e LVGL può utilizzare una parte di questa memoria per:

source: Some of the state changes are indev-type specific.
it_it: Alcune delle modifiche dello stato sono specifiche del tipo indev.

source: Some practical notes:
it_it: Alcune note pratiche:

source: Some properties (e.g. text color) can be inherited from a parent(s) if it's not specified in a Widget.
it_it: Alcune proprietà (ad esempio, il colore del testo) possono essere ereditate da uno o più elementi padre se non sono specificate in un Widget.

source: Some properties (particularly the text-related ones) can be inherited.
it_it: Alcune proprietà (in particolare quelle relative al testo) possono essere ereditate.

source: Some properties (typically those related to text) can be inherited from the parent Widget's styles.
it_it: Alcune proprietà (in genere quelle relative al testo) possono essere ereditate dagli stili del Widget genitore.

source: Some properties are read-only.
it_it: Alcune proprietà sono di sola lettura.

source: Some properties take multiple parameters.
it_it: Alcune proprietà accettano più parametri.

source: Some special purpose defines are also introduced:
it_it: Sono state introdotte anche alcune definizioni speciali:

source: Some versions of ``gdb`` on Windows (e.g. those delivered with various versions of Perl) are compiled without Python support, so the ``source`` command will not be supported.
it_it: Alcune versioni di ``gdb`` su Windows (ad esempio quelle fornite con varie versioni di Perl) sono compilate senza il supporto Python, quindi il comando ``source`` non sarà supportato.

source: Some widget attributes can be enabled or disabled using :cpp:expr:`lv_obj_add_flag(widget, LV_OBJ_FLAG_...)` and :cpp:expr:`lv_obj_remove_flag(widget, LV_OBJ_FLAG_...)`.
it_it: Alcuni attributi dei widget possono essere abilitati o disabilitati utilizzando :cpp:expr:`lv_obj_add_flag(widget, LV_OBJ_FLAG_...)` e :cpp:expr:`lv_obj_remove_flag(widget, LV_OBJ_FLAG_...)`.

source: Some widgets (e.g., label, slider) support binding the subject's value directly to the widget.
it_it: Alcuni widget (ad esempio, label, slider) supportano il binding del valore del soggetto direttamente al widget.

source: Sometimes 3rd party boards have a sample STM32Cube project.
it_it: A volte le schede di terze parti dispongono di un progetto STM32Cube di esempio.

source: Sometimes an Animation needs to play forward, and then play backwards, effectively reversing course, animating from the ``end`` value back to the ``start`` value again.
it_it: A volte un'animazione deve essere riprodotta in avanti e poi all'indietro, invertendo di fatto il percorso, animando dal valore ``end`` al valore ``start`` di nuovo.

source: Sometimes it takes a lot of time to open an image.
it_it: A volte l'apertura di un'immagine richiede molto tempo.

source: Sometimes these features can be utilized together at the same time.
it_it: A volte queste funzionalità possono essere utilizzate contemporaneamente.

source: Sometimes this is done by copying colors from places like background- and foreground-color properties.
it_it: A volte questo viene fatto copiando i colori da elementi quali le proprietà dei colori di sfondo e di primo piano.

source: Soon after the File Explorer is created, you typically use :cpp:expr:`lv_file_explorer_set_quick_access_path(explorer, LV_EXPLORER_XXX_DIR, "path")` to set the path that will be navigated to when the buttons in the ``Quick-Access Panel`` are clicked, which is currently a fixed list.
it_it: Subito dopo la creazione di File Explorer, in genere si usa :cpp:expr:`lv_file_explorer_set_quick_access_path(explorer, LV_EXPLORER_XXX_DIR, "path")` per impostare il percorso a cui si accederà quando si clicca sui pulsanti nel ``Pannello Quick-Access``, che attualmente è un elenco fisso.

source: Sort
it_it: Ordinamento

source: Sorting a List using up and down buttons
it_it: Ordinamento di un elenco utilizzando i pulsanti Su e Giù

source: Source image alignment: The byte alignment requirement for a pixel depends on the specific pixel format.
it_it: Allineamento dell'immagine sorgente: Il requisito di allineamento dei byte per un pixel dipende dal formato specifico del pixel.

source: Source images are converted to cube map format at the sampler's cube map resolution
it_it: Le immagini sorgenti vengono convertite in formato cube map alla risoluzione del "sampler [campionatore]

source: Space between the border and the content/children.
it_it: Spazio tra il bordo e il contenuto/gli elementi figlio.

source: Space outside the widget (used only in some layouts).
it_it: Spazio esterno al widget (utilizzato solo in alcuni layout).

source: Span with custom styles
it_it: Span con stili personalizzati

source: Spangroups store their children differently from normal Widgets, so normal functions for getting children won't work.
it_it: Gli Spangroup memorizzano i propri elementi figlio in modo diverso dai normali Widget, quindi le normali funzioni per ottenere elementi figlio non funzioneranno.

source: Spans can be added to, and removed from, the Spangroup throughout its life.
it_it: Gli Span possono essere aggiunti e rimossi dallo Spangroup per tutta la sua durata.

source: Speaking of memory leaks, you can also acquire stats of the memory used by LVGL
it_it: A proposito di memory leak, è anche possibile acquisire statistiche sulla memoria utilizzata da LVGL.

source: Special Events
it_it: Eventi Speciali

source: Special Fonts
it_it: Font Speciali

source: Special Symbols
it_it: Simboli Speciali

source: Specific Widget Types
it_it: Tipi di Widget Specifici

source: Specifically, if there are 4 tiles and 4 cores, there will always be an independent area for each core within one of the tiles.
it_it: In particolare, se ci sono 4 riquadri e 4 core, ci sarà sempre un'area indipendente per ogni core all'interno di uno dei riquadri.

source: Specifically:
it_it: In particolare:

source: Specify placeholder text using :cpp:expr:`lv_textarea_set_placeholder_text(textarea, "Placeholder text")`.
it_it: Specificare il testo segnaposto utilizzando :cpp:expr:`lv_textarea_set_placeholder_text(textarea, "Placeholder text")`.

source: Specify the GTK version for the application with ``--gtk-version=3``.
it_it: Specificare la versione GTK per l'applicazione con ``--gtk-version=3``.

source: Specify the language after the directive for appropriate syntax highlighting.
it_it: Specificare il linguaggio dopo la direttiva per un'evidenziazione sintattica appropriata.

source: Specify the text direction along the arc using :cpp:expr:`lv_arclabel_set_dir(arclabel, LV_ARCLABEL_DIR_CLOCKWISE)` or :cpp:expr:`lv_arclabel_set_dir(arclabel, LV_ARCLABEL_DIR_COUNTERCLOCKWISE)`.
it_it: Specificare la direzione del testo lungo l'arco utilizzando :cpp:expr:`lv_arclabel_set_dir(arclabel, LV_ARCLABEL_DIR_CLOCKWISE)` o :cpp:expr:`lv_arclabel_set_dir(arclabel, LV_ARCLABEL_DIR_COUNTERCLOCKWISE)`.

source: Specify to use a .defconfig file instead of the current .config in a Kconfig setup.
it_it: Specifica di utilizzare un file .defconfig al posto del file .config corrente in una configurazione di Kconfig.

source: Specs
it_it: Specifiche

source: Speed vs Time
it_it: Velocità vs Tempo

source: Sphinx References (What Sphinx Adds to Docutils)
it_it: Riferimenti a Sphinx (Cosa aggiunge Sphinx a Docutils)

source: Spinbox contains an integer displayed as a decimal number with a possible fixed decimal point position and a configurable number of digits.
it_it: Spinbox contiene un numero intero visualizzato come numero decimale con una possibile posizione fissa del punto decimale e un numero di cifre configurabile.

source: Spinbox's parts are identical to those of :ref:`Text Area <lv_textarea_parts_and_styles>`.
it_it: Le parti di Spinbox sono identiche a quelle della :ref:`Text Area <lv_textarea_parts_and_styles>`.

source: Spinner's parts are identical to those of :ref:`Arc <lv_arc_parts_and_styles>`.
it_it: Le parti dello Spinner sono identiche a quelle di :ref:`Arc <lv_arc_parts_and_styles>`.

source: Splitting an Image
it_it: Suddivisione di un'Immagine

source: Stack navigation example
it_it: Esempio di navigazione dello stack

source: Standard ARGB with 8 bits per color channel
it_it: ARGB standard con 8 bit per canale colore

source: Standard RGB with 8 bits per color channel
it_it: RGB standard con 8 bit per canale colore

source: Standard RGB565 (little-endian format)
it_it: RGB565 standard (formato little-endian)

source: Start animation on an event
it_it: Avviare l'animazione su un evento

source: Start by copying the contents of ``lvgldemo.c``.
it_it: Iniziamo copiando il contenuto di ``lvgldemo.c``.

source: Start creating the folder architecture
it_it: Iniziare la creazione dell'architettura delle cartelle

source: Start the container like so, using the image ID:
it_it: Avviare il container in questo modo, utilizzando l'ID immagine:

source: Start with at least 58 KB (58368 bytes) and increase if needed based on your application.
it_it: Iniziare con almeno 58 KB (58368 byte) e aumentare se necessario in base all'applicazione.

source: Start with this configuration as a base, but this configuration needs to be changed to meet lvgl requirements.
it_it: Iniziare con questa configurazione come base, ma deve essere modificata per soddisfare i requisiti di lvgl.

source: Starting an Animation
it_it: Avvio di un'Animazione

source: Starting angle in degrees (e.g., 0° is 3 o'clock, 90° is 6 o'clock).
it_it: Angolo iniziale in gradi (ad esempio, 0° corrisponde alle ore 3, 90° alle ore 6).

source: Starting from v8, every minor release is supported for 1 year.
it_it: A partire dalla v8, ogni release minor è supportata per 1 anno.

source: Starting the LVGL component
it_it: Avvio del componente LVGL

source: State Management
it_it: Gestione degli Stati

source: State management (NULL, READY, PAUSED, PLAYING)
it_it: Gestione dello stato (NULL, READY, PAUSED, PLAYING)

source: States
it_it: Stati

source: States are usually changed automatically by the library as the user interacts with a widget (e.g., pressing, releasing, focusing).
it_it: Gli stati vengono solitamente modificati automaticamente dalla libreria quando l'utente interagisce con un widget (ad esempio, premendo, rilasciando, mettendo nel "focus").

source: States have a precedence which is shown by their value (see in the above list).
it_it: Gli stati hanno una precedenza, indicata dal loro valore (vedere l'elenco sopra).

source: Static Positioning
it_it: Posizionamento Statico

source: Static RAM usage: ~2 kB depending on the used features and Widget types
it_it: Utilizzo di RAM statica: ~2 kB a seconda delle funzionalità utilizzate e dei tipi di Widget

source: Static Sizing
it_it: Dimensionamento Statico

source: Static Translations
it_it: Traduzioni Statiche

source: Static text (i.e. const) is not processed.
it_it: Il testo statico (ad esempio, const) non viene elaborato.

source: Static text can be set with :cpp:expr:`lv_arclabel_set_text_static(arclabel, static_text)`, which avoids dynamic memory allocation.
it_it: Il testo statico può essere impostato con :cpp:expr:`lv_arclabel_set_text_static(arclabel, static_text)`, che evita l'allocazione dinamica della memoria.

source: Step Types
it_it: Tipi di Passi

source: Step-by-Step Guide
it_it: Guida Passo-Passo

source: Step-by-Step Setup
it_it: Configurazione Passo-Passo

source: Step-by-step
it_it: Passo dopo passo

source: Steps 2, 3 and 5 use QNX-specific calls, but the rest of the code should be identical to that of a LVGL application written for any other platform.
it_it: I passaggi 2, 3 e 5 utilizzano chiamate specifiche per QNX, ma il resto del codice dovrebbe essere identico a quello di un'applicazione LVGL scritta per qualsiasi altra piattaforma.

source: Stop any automatically started demos (on G2UL run ``systemctl stop demo-launcher`` in the terminal).
it_it: Interrompere eventuali demo avviate automaticamente (su G2UL eseguire ``systemctl stop demo-launcher`` nel terminale).

source: Stop the Wayland desktop if using the OpenGL, DRM, or fbdev drivers.
it_it: Arrestare il desktop Wayland se si utilizzano i driver OpenGL, DRM o fbdev.

source: Stride does not need to be specified because it will be computed by the renderer.
it_it: Non è necessario specificare Stride perché verrà calcolato dal motore di rendering.

source: String
it_it: Stringa

source: Strings: ``type="string('Ok' 'Cancel')``
it_it: Stringhe: ``type="string('Ok' 'Cancel')``

source: Stripe pattern and range value
it_it: Motivo a strisce e valore dell'intervallo

source: Strives to be as compatible as possible with normal Python (known as CPython).
it_it: Cerca di essere il più compatibile possibile con Python standard (noto come CPython).

source: Structure of the Exported Code
it_it: Struttura del Codice Esportato

source: Style
it_it: Stile

source: Style Binding
it_it: Binding di Style

source: Style Interface
it_it: Interfaccia dello Stile

source: Style Properties
it_it: Proprietà di Stile

source: Style Sheets
it_it: Fogli di Stile

source: Style ``text_line_space`` adjusts the space between list items.
it_it: Lo stile ``text_line_space`` regola lo spazio tra gli elementi della lista.

source: Style properties
it_it: Proprietà di stile

source: Style variables should be ``static``, global or dynamically allocated.
it_it: Le variabili di stile devono essere ``static``, globali o allocate dinamicamente.

source: Styles
it_it: Stili

source: Styles Overview
it_it: Panoramica sugli Stili

source: Styles added later have precedence over ones set earlier.
it_it: Gli stili aggiunti in seguito hanno la precedenza su quelli impostati in precedenza.

source: Styles and Constants are also shown.
it_it: Vengono mostrati anche Stili e Costanti.

source: Styles are carried in :cpp:struct:`lv_style_t` objects.
it_it: Gli stili sono contenuti in oggetti :cpp:struct:`lv_style_t`.

source: Styles are stored in :cpp:type:`lv_style_t` variables.
it_it: Gli stili vengono memorizzati nelle variabili :cpp:type:`lv_style_t`.

source: Styles are used to set the appearance of Widgets.
it_it: Gli stili vengono utilizzati per impostare l'aspetto dei Widget.

source: Styles can be assigned to Widgets to change their appearance.
it_it: Gli stili possono essere assegnati ai Widget per modificarne l'aspetto.

source: Styles can be cascaded which means multiple styles may be assigned to a Widget and each style can have different properties.
it_it: Gli stili sono sovrapponibili, il che significa che è possibile assegnare più stili a un widget e ogni stile può avere proprietà diverse.

source: Styles can be referenced like this in the ``<view>``:
it_it: Gli stili possono essere referenziati in questo modo in ``<view>``:

source: Styles in LVGL are heavily inspired by CSS.
it_it: Gli stili in LVGL sono fortemente ispirati ai CSS.

source: Styling
it_it: Stili

source: Styling Sections
it_it: Stili delle Sezioni

source: Styling a bar
it_it: Stile di una barra

source: Styling buttons
it_it: Pulsanti con stili

source: Styling the roller
it_it: Roller con stili

source: Styling the scrollbars
it_it: Stile delle barre di scorrimento

source: Subject Groups
it_it: Gruppi di Subject

source: Subject Initialization
it_it: Inizializzazione del Subject

source: Subject Related Events
it_it: Eventi Relativi al Subject

source: Subject's float value is used with the ``format_string`` argument.
it_it: Il valore float del Subject viene utilizzato con l'argomento ``format_string``.

source: Subject's integer value is used with the ``format_string`` argument.
it_it: Il valore intero di Subject viene utilizzato con l'argomento ``format_string``.

source: Subject's string is used to directly update the Label's text.
it_it: La stringa del Subject viene utilizzata per aggiornare direttamente il testo della Label.

source: Subjects
it_it: Subject

source: Subjects Tab
it_it: Scheda Subjects

source: Subjects and Observers
it_it: Soggetti e Osservatori

source: Subjects and Observers are powerful tools to easily create data bindings.
it_it: Soggetti e Osservatori sono strumenti potenti per creare facilmente data binding.

source: Subjects are global :cpp:expr:`lv_subject_t` variables that store integer, color, string, etc. values.
it_it: I soggetti sono variabili globali :cpp:expr:`lv_subject_t` che memorizzano valori interi, colori, stringhe, ecc.

source: Subjects can be created in ``globals.xml`` like this:
it_it: I soggetti possono essere creati in ``globals.xml`` in questo modo:
